[
  "How do monkeys stay safe when they walk down the stairs? They hold on to the banana-ister.",
  "“I am going bananas!” That’s what I say to my bananas before I leave the house.",
  "You need to be extra nice to bananas, you know why? You don’t want to hurt their peelings.",
  "Why was the banana so upset? Someone mistook him for a plantain!",
  "Why did the banana go out with the prune? Because he couldn’t find a date.",
  "Why did the banana have to go to the hair salon? Because she had split ends.",
  "Why do bananas never get lonely? Because they hang out in bunches.",
  "What is the easiest way to make a banana split? Cut it in half.",
  "What’s the best thing to put in a banana cream pie? Your teeth!",
  "Why did the banana go to the doctor? Because he wasn’t peeling well.",
  "If a crocodile makes shoes, what does a banana make? Slippers!",
  "What do you call a charismatic banana? A banana smoothie!",
  "What kind of school do bananas go to? Sundae school.",
  "What do you call solid gold bananas? A bunch of money.",
  "A little girl said: “I know how to spell ‘banana’…” “… I just don’t know when to stop.”",
  "What was Beethoven’s favorite fruit? Ba-na-na-naaaaa.",
  "Why didn’t the banana student go to school? He told his parents that he wasn’t peeling well.",
  "Did you know that banana peel is supposed to be put under the controlled substance act? It can give you bad trips.",
  "What’s yellow and goes 30 miles per hour? A banana in a washing machine (Ewwwww!)",
  "What is the hippest kind of fruit? A bae-nae-nae.",
  "Why do monkeys like bananas so much? Because they are very apeeling.",
  "How can you easily spot an optimist? An older person buying green bananas.",
  "What happens when you tell a banana a really funny joke? They break out into side-splitting laughter!",
  "Why did the banana fail his driving test? He kept peeling out.",
  "What do you do when you see a blue banana? Try to cheer it up.",
  "One man to another: “Excuse me, you have a banana in your ear!” The other says: “I can’t hear you, I have a banana in my ear!”",
  "Why couldn’t the police catch the banana? Because he split!",
  "What do you call bananas who are friends with monkeys? A bunch of idiots.",
  "What is a banana’s favorite day of the week? Sundae.",
  "Time flies like an arrow. Fruit flies like a banana.",
  "Why did the man lose his job in a fruit packing firm? He kept throwing the bent bananas away.",
  "What did the green banana think about the ripe banana? He was green with envy.",
  "What do you call the period of time between slipping on a banana and landing on your butt? A bananosecond.",
  "Why didn’t the banana cross the road? Because he was yellow.",
  "How did the Mother Banana spoil the Baby Banana? She left him out in the sun too long.",
  "Why was the banana so sick he had to go to the hospital? He had yellow mellow fever.",
  "What do a banana and a helicopter have in common? Neither of them is a police officer.",
  "Why did the banana get so many Valentine’s Day gifts? Because it was SO sweet.",
  "Did you hear about the unlucky man who bought some bananas? They were empty.",
  "What did the orange say to the green banana? You don’t look like you’re peeling well.",
  "A hot dog and a banana had a race. Who won? The wiener.",
  "Knock Knock Who’s there! Banana! Banana who? Banana split some ice cream?",
  "Why don’t bananas snore? Because they don’t want to wake up the rest of the bunch.",
  "Why did the banana farmer lose his job? Because he kept throwing away the bent bananas.",
  "What is a ghost’s favorite fruit? A boo-nana.",
  "What is yellow on the inside and green on the outside? A banana dressed up as a cucumber.",
  "What do bananas wear on their feet? A pair of slippers.",
  "What did the banana do when he saw a monkey coming? He split.",
  "What happened to the banana who got a sunburn? He peeled.",
  "What do you call a banana eating a banana? Canabananalism.",
  "What’s worse than a monkey eating bananas? A monkey going bananas.",
  "Why do bananas use sunblock? Because otherwise, they’d peel.",
  "Today I learned humans eat more bananas than monkeys. Weird. I can’t remember ever eating a monkey.",
  "Where do bananas go shopping for clothes? Banana Republic.",
  "What is yellow and goes bzzzzzz? An electric banana.",
  "What is a sheep’s favorite fruit? A baaaa-nana.",
  "What do fruit use to buy things? Banana bread.",
  "What is the key to opening a banana? A mon-key.",
  "How can you tell the difference between a monster and a banana? Try picking it up. If you can’t, it’s either a monster or a giant banana.",
  "How does a banana answer the phone? “Yellow?”",
  "They’re not going to grow bananas any longer. Apparently, they’re long enough already.",
  "What happens when two bananas break up? A banana split.",
  "What kinds of jokes do bananas like to tell? Side-splitting ones.",
  "What did one banana say to the other banana that she just met? Yellow, nice to meet you.",
  "What is the easiest way to make a banana split? Show it out the door.",
  "When will the trail mix have enough money to buy a map? After the banana chips in.",
  "What’s yellow and always points north? A magnetic banana.",
  "What did the banana say to the monkey? Nothing, bananas can’t talk!",
  "Why did they cancel the ice cream social? The banana split with the ice cream.",
  "Why did the kid keep falling off his bike? It had a banana seat.",
  "What’s yellow and used to write letters? A ball-point banana.",
  "How is a banana peel on the floor like music? If you don’t C sharp you’ll B flat.",
  "Someone who eats bananas must like them a whole bunch.",
  "What fruit teases you a lot? A ba-na-na-na-na-na",
  "Knock, knock. Who’s there? Banana. Banana who? Knock, knock. Who’s there? Banana. Banana who? Knock, knock. Who’s there? Orange. Orange who? ORANGE YOU GLAD I DIDN’T SAY BANANA!",
  "Want to hear a potassium joke? K.",
  "What do you call two bananas? A pair of slippers.",
  "Why was the plantain sent to the principal’s office? It went bananas during class.",
  "Where do bananas like to go swimming? In a cereal bowl.",
  "Where do bananas go to learn? Sundae school.",
  "In what position was the banana during the Tour de France? He was riding with the peel-oton.",
  "How do monkeys get downstairs? They slide down the banana-ster.",
  "Which former politician loves bananas? Al Gore-illa.",
  "Why couldn’t the banana yell high? Because it could only yel-low.",
  "What did the apple say to the green banana? You don’t look like you’re feeling so good.",
  "What is it called when someone dressed as a banana eats a banana? Cannibananalism.",
  "Why didn’t the man like invisible bananas? He couldn’t see the appeal.",
  "What’s invisible and smells like bananas? Monkey farts.",
  "What do you get when you cross an elephant with a banana? |elephant| |banana| sin(θ).",
  "How do you catch King Kong? Hang upside down and act like a giant banana.",
  "Bananas go out in a yellow submarine.",
  "Beethoven’s favorite fruit is Banana..an.",
  "I peel it in my heart.",
  "Woohoo! This cover creates some peel inside me.",
  "After hearing your joke, I’m peeling better now.",
  "She is the ripe one for you.",
  "You’re ripe; I should go for it.",
  "She is quite peal-ing in front of others.",
  "Bananas don’t snore because they don’t want to disturb another bunch.",
  "What did the banana say to the judge? “I’m going to win this case on a-peel!”",
  "If a man has six apples in one hand and eight bananas in the other, what has he got? Massive hands.",
  "How do you spell banana split? Ba-nana.",
  "What is the favorite snack of the Super Mario Brothers? Banana-nana-nana.",
  "If farmer A sells apples, farmer B sells bananas, what does farmer C sell? Medicine.",
  "What is the chemical formula for a banana? BaNa 2",
  "What do you call a banana who can’t decide between coffee or tea? Banana split.",
  "Why couldn’t the whipped cream find the banana? Because it split.",
  "Why didn’t the banana cross the road? It can’t walk — it’s a banana, silly!",
  "What do you call a banana that likes to dance? A banana shake.",
  "What did the mommy banana say to the baby banana? “You give me all the peels.”"
]
